       IDENTIFICATION DIVISION.
       PROGRAM-ID.        salesTax.
      *PROGRAMMER.        ANDERS GREVE SØRENSEN.
      *COMPLETION-DATE    25/09/2025
      *REMARKS            SIMPLE PROGRAM WRITTEN TO LEARN BASIC
      *                   COBOL PRACTICES. CODE TAKEN FROM
      *                   MIKE MURACHS MAINFRAME COBOL BOOK.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       77  OFF-SWITCH   PIC X VALUE "N".
       77  SALES-AMOUNT PIC 9(5)V99.
       77  SALES-TAX    PIC Z,ZZZ.99.

       PROCEDURE DIVISION.

       000-CALCULATE-SALES-TAX.
           PERFORM 100-CALCULATE-ONE-SALES-TAX UNTIL OFF-SWITCH = "Y".
           DISPLAY "END OF SESSION"
           STOP RUN.

       100-CALCULATE-ONE-SALES-TAX.
           DISPLAY "--------------------------------".
           DISPLAY "TO END PROGRAM, ENTER 0".
           DISPLAY "ENTER SALES AMOUNT TO CALCULATE TAX FOR : ".
           ACCEPT SALES-AMOUNT.
           IF SALES-AMOUNT = ZERO MOVE 'Y' TO OFF-SWITCH
           ELSE
              COMPUTE SALES-TAX ROUNDED = SALES-AMOUNT * 0.0785
              DISPLAY "SALES TAX = " SALES-TAX.

           