       IDENTIFICATION DIVISION.
       PROGRAM-ID. "helloWorld".


       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello World!".

           STOP RUN.
