       IDENTIFICATION DIVISION.
       PROGRAM-ID. investmentCalculation.
      *PROGRAMMER.        ANDERS GREVE SØRENSEN.
      *COMPLETION-DATE    25/09/2025
      *REMARKS            SIMPLE PROGRAM WRITTEN TO LEARN BASIC
      *                   COBOL PRACTICES. CODE TAKEN FROM
      *                   MIKE MURACHS MAINFRAME COBOL BOOK.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01  USER-ENTRIES.
           05 NUMBER-ENTERED PIC 9 VALUE 1.
           05 INVESTMENT-AMOUNT PIC 9(6).
           05 NUMBER-OF-YEARS PIC 99.
           05 YEARLY-INTEREST-RATE PIC 99V99.

       01  WORK-FIELDS.
           05 FUTURE-VALUE pic 9(7)V99.
           05 YEAR-COUNTER PIC 999.
           05 EDITED-FUTURE-VALUE PIC Z,ZZZ,ZZZ.99.
           

       PROCEDURE DIVISION.

       000-CALCULATE-FUTURE-VALUES.
           PERFORM 100-CALCULATE-FUTURE-VALUE
              UNTIL NUMBER-ENTERED = ZERO.
           DISPLAY "END OF SESSION".
           STOP RUN.

       100-CALCULATE-FUTURE-VALUE.
           DISPLAY "-------------------------------------".
           DISPLAY "TO END THE PROGRAM, ENTER 0".
           DISPLAY "TO PERFORM ANOTHER CALCULATION, ENTER 1".
           ACCEPT NUMBER-ENTERED.
           DISPLAY "-------------------------------------".
           IF NUMBER-ENTERED = 1
              PERFORM 110-GET-USER-VALUES.
              MOVE INVESTMENT-AMOUNT TO FUTURE-VALUE.
              MOVE 1 TO YEAR-COUNTER.
              PERFORM 120-CALCULATE-NEXT-FV UNTIL 
                 YEAR-COUNTER > NUMBER-OF-YEARS.
              MOVE FUTURE-VALUE TO EDITED-FUTURE-VALUE.
              DISPLAY "FUTURE VALUE = " EDITED-FUTURE-VALUE.
              


       110-GET-USER-VALUES.
           DISPLAY "ENTER INVESTMENT-AMOUNT: ".
           ACCEPT INVESTMENT-AMOUNT.
           DISPLAY "ENTER NUMBER OF YEARS: ".
           ACCEPT NUMBER-OF-YEARS.
           DISPLAY "ENTER YEARLY INTEREST RATE: ".
           ACCEPT YEARLY-INTEREST-RATE.
           
       120-CALCULATE-NEXT-FV.
           COMPUTE FUTURE-VALUE ROUNDED = FUTURE-VALUE + 
           (FUTURE-VALUE * YEARLY-INTEREST-RATE / 100).
           COMPUTE YEAR-COUNTER = YEAR-COUNTER + 1.
